results/l3_fio/BIWIN_ext4_test1_seq1t.txt
seq1t: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
fio-3.41
Starting 1 process

seq1t: (groupid=0, jobs=1): err= 0: pid=126471: Sat Jun 13 21:24:31 2026
  read: IOPS=4765, BW=4765MiB/s (4997MB/s)(23.3GiB/5001msec)
    slat (usec): min=76, max=286, avg=79.41, stdev= 1.99
    clat (usec): min=109, max=279, avg=130.21, stdev= 4.97
     lat (usec): min=202, max=449, avg=209.62, stdev= 5.34
    clat percentiles (usec):
     |  1.00th=[  125],  5.00th=[  126], 10.00th=[  127], 20.00th=[  128],
     | 30.00th=[  129], 40.00th=[  129], 50.00th=[  130], 60.00th=[  131],
     | 70.00th=[  133], 80.00th=[  133], 90.00th=[  137], 95.00th=[  139],
     | 99.00th=[  141], 99.50th=[  143], 99.90th=[  202], 99.95th=[  225],
     | 99.99th=[  265]
   bw (  MiB/s): min= 4730, max= 4774, per=100.00%, avg=4766.20, stdev=13.51, samples=10
   iops        : min= 4730, max= 4774, avg=4766.20, stdev=13.51, samples=10
  lat (usec)   : 250=99.99%, 500=0.01%
  cpu          : usr=0.16%, sys=38.46%, ctx=23837, majf=0, minf=265
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=23831,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4765MiB/s (4997MB/s), 4765MiB/s-4765MiB/s (4997MB/s-4997MB/s), io=23.3GiB (25.0GB), run=5001-5001msec

Disk stats (read/write):
  nvme1n1: ios=186565/2, sectors=47760640/120, merge=0/13, ticks=28581/2, in_queue=28583, util=67.25%