results/l3_fio/BIWIN_ext4_test3_seq4t.txt
seq4t: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.41
Starting 4 processes

seq4t: (groupid=0, jobs=4): err= 0: pid=127956: Sat Jun 13 21:27:27 2026
  read: IOPS=6471, BW=6472MiB/s (6786MB/s)(31.6GiB/5001msec)
    slat (usec): min=66, max=387, avg=79.18, stdev= 7.96
    clat (usec): min=226, max=984, avg=538.35, stdev=94.53
     lat (usec): min=315, max=1075, avg=617.54, stdev=95.19
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  392], 10.00th=[  420], 20.00th=[  457],
     | 30.00th=[  486], 40.00th=[  510], 50.00th=[  537], 60.00th=[  562],
     | 70.00th=[  586], 80.00th=[  619], 90.00th=[  660], 95.00th=[  701],
     | 99.00th=[  783], 99.50th=[  807], 99.90th=[  881], 99.95th=[  906],
     | 99.99th=[  947]
   bw (  MiB/s): min= 6354, max= 6722, per=100.00%, avg=6473.00, stdev=28.55, samples=40
   iops        : min= 6354, max= 6722, avg=6473.00, stdev=28.55, samples=40
  lat (usec)   : 250=0.01%, 500=36.24%, 750=61.88%, 1000=1.87%
  cpu          : usr=0.20%, sys=13.11%, ctx=32372, majf=0, minf=1059
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32365,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6472MiB/s (6786MB/s), 6472MiB/s-6472MiB/s (6786MB/s-6786MB/s), io=31.6GiB (33.9GB), run=5001-5001msec

Disk stats (read/write):
  nvme1n1: ios=253284/16, sectors=64840704/392, merge=0/17, ticks=96900/207, in_queue=97113, util=81.18%