results/l3_fio/Seagate_NTFS_test1_seq1t.txt
seq1t: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
fio-3.41
Starting 1 process

seq1t: (groupid=0, jobs=1): err= 0: pid=126735: Sat Jun 13 21:24:42 2026
  read: IOPS=3032, BW=3032MiB/s (3180MB/s)(14.8GiB/5001msec)
    slat (usec): min=75, max=297, avg=78.43, stdev= 2.50
    clat (usec): min=167, max=510, avg=251.09, stdev=46.42
     lat (usec): min=252, max=808, avg=329.52, stdev=46.58
    clat percentiles (usec):
     |  1.00th=[  176],  5.00th=[  178], 10.00th=[  190], 20.00th=[  210],
     | 30.00th=[  217], 40.00th=[  235], 50.00th=[  253], 60.00th=[  260],
     | 70.00th=[  265], 80.00th=[  310], 90.00th=[  326], 95.00th=[  330],
     | 99.00th=[  330], 99.50th=[  338], 99.90th=[  408], 99.95th=[  449],
     | 99.99th=[  498]
   bw (  MiB/s): min= 2992, max= 3044, per=100.00%, avg=3032.39, stdev=16.30, samples=10
   iops        : min= 2992, max= 3044, avg=3032.30, stdev=16.29, samples=10
  lat (usec)   : 250=44.33%, 500=55.67%, 750=0.01%
  cpu          : usr=0.18%, sys=24.14%, ctx=15169, majf=0, minf=265
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15165,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3032MiB/s (3180MB/s), 3032MiB/s-3032MiB/s (3180MB/s-3180MB/s), io=14.8GiB (15.9GB), run=5001-5001msec

Disk stats (read/write):
  nvme1n1: ios=118711/3, sectors=30390016/344, merge=0/40, ticks=25500/1, in_queue=25502, util=81.04%