results/l3_fio/Seagate_NTFS_test2_rand4k_1t.txt
rand4k_1t: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.41
Starting 1 process

rand4k_1t: (groupid=0, jobs=1): err= 0: pid=126766: Sat Jun 13 21:24:47 2026
  read: IOPS=15.3k, BW=59.6MiB/s (62.5MB/s)(298MiB/5001msec)
    slat (nsec): min=1167, max=42027, avg=1446.96, stdev=434.43
    clat (usec): min=18, max=322, avg=63.90, stdev= 8.33
     lat (usec): min=19, max=332, avg=65.34, stdev= 8.48
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   58], 10.00th=[   59], 20.00th=[   60],
     | 30.00th=[   60], 40.00th=[   60], 50.00th=[   61], 60.00th=[   62],
     | 70.00th=[   71], 80.00th=[   71], 90.00th=[   72], 95.00th=[   72],
     | 99.00th=[   82], 99.50th=[   83], 99.90th=[  174], 99.95th=[  190],
     | 99.99th=[  251]
   bw (  KiB/s): min=60312, max=61272, per=100.00%, avg=61017.30, stdev=301.25, samples=10
   iops        : min=15078, max=15318, avg=15254.30, stdev=75.30, samples=10
  lat (usec)   : 20=0.01%, 50=0.06%, 100=99.65%, 250=0.27%, 500=0.01%
  cpu          : usr=0.76%, sys=3.86%, ctx=76287, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=76287,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=59.6MiB/s (62.5MB/s), 59.6MiB/s-59.6MiB/s (62.5MB/s-62.5MB/s), io=298MiB (312MB), run=5001-5001msec

Disk stats (read/write):
  nvme1n1: ios=74670/4, sectors=597360/368, merge=0/34, ticks=4716/1, in_queue=4718, util=94.17%