results/l3_fio/WDC_NTFS_test2_rand4k_1t.txt
rand4k_1t: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.41
Starting 1 process

rand4k_1t: (groupid=0, jobs=1): err= 0: pid=126427: Sat Jun 13 21:24:26 2026
  read: IOPS=15.6k, BW=60.9MiB/s (63.8MB/s)(305MiB/5001msec)
    slat (nsec): min=1233, max=30803, avg=1456.95, stdev=389.55
    clat (usec): min=18, max=394, avg=62.47, stdev= 7.86
     lat (usec): min=20, max=396, avg=63.93, stdev= 7.98
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   57], 10.00th=[   58], 20.00th=[   58],
     | 30.00th=[   59], 40.00th=[   59], 50.00th=[   60], 60.00th=[   60],
     | 70.00th=[   69], 80.00th=[   70], 90.00th=[   71], 95.00th=[   71],
     | 99.00th=[   81], 99.50th=[   82], 99.90th=[  161], 99.95th=[  182],
     | 99.99th=[  251]
   bw (  KiB/s): min=61640, max=62704, per=100.00%, avg=62350.70, stdev=306.89, samples=10
   iops        : min=15410, max=15676, avg=15587.60, stdev=76.81, samples=10
  lat (usec)   : 20=0.01%, 50=0.04%, 100=99.71%, 250=0.23%, 500=0.01%
  cpu          : usr=1.00%, sys=3.80%, ctx=77954, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=77954,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=60.9MiB/s (63.8MB/s), 60.9MiB/s-60.9MiB/s (63.8MB/s-63.8MB/s), io=305MiB (319MB), run=5001-5001msec

Disk stats (read/write):
  nvme1n1: ios=76328/21, sectors=610624/664, merge=0/36, ticks=4710/7, in_queue=4720, util=93.85%